{"data":{"l10NJson":{"projects":{"title":"Here are a few projects that I have worked on","gallery":[{"title":"Propensity","text":"Propensity is an app designed to help small charitable organizations manage their community of patrons. The heart of the app is built around a kanban board that simplifies identification of priority patrons and helps users take action. This is a project that I am currently volunteering to build. Slowly, but steadily. Built with _Django_ and the _React ecosystem_.","repo":"https://demopropensity.herokuapp.com/","url":"https://demopropensity.herokuapp.com/"},{"title":"ohi","text":"Ogura Hyakunin Isshu is an anthology of 100 poems written by 100 prominent Japanese poets. Inspired by this anthology, I created a site that displays a list of the poems and let's users search through them. The site is minimal in design and setup because it was meant to be a test ground for different technologies and app designs for Propensity. Built with _Django_ and _React_.","repo":"https://github.com/AgentBoo/django-hyakunin-isshu","url":"https://github.com/AgentBoo/django-hyakunin-isshu"},{"title":"focallocal.org","text":"Focallocal.org is a hub for a volunteer community to coordinate, collaborate, and grow projects aimed at helping homeless people and other people in need. The project is based on _Meteor_ and _React_. My contributions were on the front-end, fixing small issues in the UI and React form components.","repo":"https://github.com/AgentBoo/fl-maps","url":"https://focallocal.org/"},{"title":"BrewDo","text":"BrewDo allows homebrewers to collect, create, and iteratively experiment with beer recipe formulas, while keeping track of changes made from batch to batch. BrewDo was an 18 day group project at the Iron Yard, built with _Rails, Omniauth, Kaminari, diffy_, and _Bootstrap_. I was either fixing issues, or working on the action controllers and routing, but I also contributed to the layouts and view templates.","repo":"https://github.com/jakedub/brewdo","url":"http://brewdo.herokuapp.com/"}]}}}}