{"data":{"l10NJson":{"about":{"title":"About me","summary":"I am a self-starter and self-learner, and because of that, I know I wouldn't want to work alone during long marathons","details":[{"title":"The Iron Yard","text":"I spent 3 months at the Iron Yard bootcamp in _Indianapolis, IN_, training full-time as a front-end and back-end developer. The first month was dedicated towards fundamentals in _HTML5_, _CSS3_, and JavaScript (_ES6_). The curriculum that followed was focused on the back-end, with one month dedicated to the _Express_ framework for _Node.js_ and database fundamentals, and one month to the _Rails_ framework.\nUnfortunately, the Iron Yard was closed down soon after I graduated."},{"title":"Biochemistry","text":"My background is in Biochemistry and Life Sciences. While at school, I worked at the proteins simulation lab, which introduced me to _scripting_ among other things. I was enjoying the lab hours a lot, but I realized I enjoyed the programming aspect of it even more so. I eventually started looking into professions that would let me combine my science training with my newfound enjoyment of programming without having to spend more time at school. \nHence, web development.\nUltimately, I want to become a person who has the skillset to build tools that make science (preferrably life sciences, right) attractive, approachable, and accessible for everyone. It doesn't have to be right now, but I want to get there eventually."}],"addendum":{"title":"Other than that","text":"I was born in _Vietnam_, although I didn't get to stay there for very long. As soon as I was 18lb old, my family moved to the _Czech Republic_ and made it our new home. I spent most of my life there, and it wasn't half bad, so I'm glad my parents made that choice. It's a really lovely place.\nThen, I decided to move to the US a few years ago. I lived in _Virginia_ for some time, and now I live in _Indiana_. I think I'm going to stay here for a little while, but who knows, life seems to like pushing me to the west a lot. Maybe one day, I will make it full circle around the planet."}}}}}